In [1]:
import pandas as pd
import numpy as np

# fast scalar value getting and setting
### at === loc
### iat === iloc

In [2]:
s = pd.Series([1,2,3,4] , index=['a','b','c','d'])

In [3]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
s.iat[1]

2

In [7]:
df = pd.DataFrame({'A':[1,2,3,4] , 'B':[4,5,6,7]})
df

   A  B
0  1  4
1  2  5
2  3  6
3  4  7

In [11]:
df.at[1 , 'A'] #1 and 'A' are label index

2

In [12]:
df.iat[0,1]

4

In [13]:
#也可以使用at iat进行赋值
df.at[1,'B'] = 53 #label index
#df.iat[1 , 1] = 53 #integer index
df

   A   B
0  1   4
1  2  53
2  3   6
3  4   7

In [14]:
#如果指定的index没有的话 at会添加一个index
df.at[0 , 'C'] = 52
df

   A   B     C
0  1   4  52.0
1  2  53   NaN
2  3   6   NaN
3  4   7   NaN

# boolean indexing
#### | = or
#### & = and
#### ~ = not

In [15]:
#使用Boolean类型的vector进行访问
s = pd.Series(range(-3 , 4))
s

0   -3
1   -2
2   -1
3    0
4    1
5    2
6    3
dtype: int32

In [16]:
s[s>0]

4    1
5    2
6    3
dtype: int32

In [17]:
s[(s<-1)|(s>0.5)]

0   -3
1   -2
4    1
5    2
6    3
dtype: int32

In [18]:
s[~(s<0)]

3    0
4    1
5    2
6    3
dtype: int32

In [20]:
df[df['A']%2==0] #Boolean长度与index的长度一样 进行选择 根据条件会得到满足条件的若干行

   A   B   C
1  2  53 NaN
3  4   7 NaN

In [21]:
#list  and map method
df2 = pd.DataFrame({'a':['one','one','two','three','two','one','six'],
                    'b':['x','y','y','x','y','x','x'],
                    'c':np.random.randn(7)})
df2

       a  b         c
0    one  x  1.405310
1    one  y  0.740840
2    two  y  1.755960
3  three  x -3.181328
4    two  y  0.878512
5    one  x  0.057710
6    six  x  2.359227

In [25]:
df2[ (df2['a'] == 'two') | (df2['a'] == 'three')]

       a  b         c
2    two  y  1.755960
3  three  x -3.181328
4    two  y  0.878512

In [27]:
criterion = df2['a'].map(lambda x: x.startswith('t'))
df2[criterion]

       a  b         c
2    two  y  1.755960
3  three  x -3.181328
4    two  y  0.878512

In [28]:
#和上面的效果一样 但是效率低一点
df2[[x.startswith('t') for x in df2['a']]]

       a  b         c
2    two  y  1.755960
3  three  x -3.181328
4    two  y  0.878512

In [29]:
df2[criterion & (df2['b'] == 'x')] #多种条件一起进行筛选

       a  b         c
3  three  x -3.181328

In [30]:
#上面的用逻辑表达式对dataframe进行控制 控制的都是行 对行进行条件过滤
df2.loc[criterion & (df2['b'] == 'x') , 'b':'c']

   b         c
3  x -3.181328

# indexing with isin
##### 传入一个value列表 isin判断这些value是否存在series之中

In [31]:
s = pd.Series(np.arange(5) , index = np.arange(5)[::-1] , dtype='int64')
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [32]:
s.isin([2,4,6]) #判断value2 4 6 是否在series中

4    False
3    False
2     True
1    False
0     True
dtype: bool

In [33]:
s[s.isin([2,4,6])]

2    2
0    4
dtype: int64

In [34]:
s1=pd.Series([1,2,3,4] , index=['fei' , 2,'2k',4])
s1

fei    1
2      2
2k     3
4      4
dtype: int64

In [35]:
s1.index.isin(['fei' , 4])

array([ True, False, False,  True], dtype=bool)

In [37]:
s1[s1.index.isin(['fei' , 4])]
#isin 的参数是真实 实在的value 、label index

fei    1
4      4
dtype: int64

In [38]:
#多索引
s_mi = pd.Series(np.arange(6) , 
                index = pd.MultiIndex.from_product([[0 , 1],['a','b','c']]))
s_mi

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
dtype: int32

In [39]:
s_mi.index

MultiIndex(levels=[[0, 1], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [40]:
s_mi.iloc[s_mi.index.isin([(1,'a'),(2,'b'),(0,'c')])]

0  c    2
1  a    3
dtype: int32

In [42]:
s_mi.iloc[s_mi.index.isin(['a','b','e'] , level=1)]

0  a    0
   b    1
1  a    3
   b    4
dtype: int32

In [43]:
#isin方法 一样可以作用于dataframe之上
df = pd.DataFrame({'vals':[1,2,3,4],
                  'ids':['a','b','f','n'],
                  'ids2':['a','n','c','n']})
df

  ids ids2  vals
0   a    a     1
1   b    n     2
2   f    c     3
3   n    n     4

In [44]:
values = ['a' , 'b', 1 , 3]
df.isin(values)

     ids   ids2   vals
0   True   True   True
1   True  False  False
2  False  False   True
3  False  False  False

In [45]:
df[df.isin(values)]

   ids ids2  vals
0    a    a   1.0
1    b  NaN   NaN
2  NaN  NaN   3.0
3  NaN  NaN   NaN

Oftentimes you’ll want to match certain values with certain columns. Just make values a dict where the key is the column, and the value is a list of items you want to check for.

In [46]:
values = {'ids':['a', 'b'] , 'vals':[1,3]}
#构建一个dict key为column value为value
df.isin(values)

     ids   ids2   vals
0   True  False   True
1   True  False  False
2  False  False   True
3  False  False  False

In [47]:
df[df.isin(values)]

   ids ids2  vals
0    a  NaN   1.0
1    b  NaN   NaN
2  NaN  NaN   3.0
3  NaN  NaN   NaN

In [48]:
values = {'ids':['a','b'],
         'ids2':['a','c'],
         'vals':[1,3]}
df.isin(values)

     ids   ids2   vals
0   True   True   True
1   True  False  False
2  False   True   True
3  False  False  False

In [52]:
df.isin(values).all(1)
#df.all()Return whether all elements are True over requested axis

0     True
1    False
2    False
3    False
dtype: bool

In [55]:
df[df.isin(values).all(1)]

  ids ids2  vals
0   a    a     1

In [54]:
df.all(1)

0    True
1    True
2    True
3    True
dtype: bool

# the where method and masking
http://pandas.pydata.org/pandas-docs/stable/indexing.html#selection-by-position

In [3]:
s = pd.Series([-1,2,3,4,5] , index=[4,3,2,1,0])
s

4   -1
3    2
2    3
1    4
0    5
dtype: int64

In [4]:
s[s>0] #输出的维数和原数据的维数不相等

3    2
2    3
1    4
0    5
dtype: int64

In [5]:
s.where(s>0) #和原数据的维数是相同的

4    NaN
3    2.0
2    3.0
1    4.0
0    5.0
dtype: float64

In [23]:
df = pd.DataFrame(np.random.randn(8,4),
                 index=pd.date_range('2001/1/1',periods=8),
                 columns=['A','B','C','D'])
df

                   A         B         C         D
2001-01-01 -1.970616  1.776911 -0.753355  0.789666
2001-01-02  0.879737  0.309945  0.560999 -0.880028
2001-01-03 -0.254124  1.378711 -1.504493  1.932818
2001-01-04 -0.141970  0.606919 -0.028522 -0.961068
2001-01-05  0.964364  1.787742 -0.050953 -0.725288
2001-01-06 -0.565382  1.478223 -0.096458  0.666745
2001-01-07  0.315894  0.188798  0.465261 -0.872529
2001-01-08 -0.236235 -0.832285  0.281321  1.246485

In [7]:
df[df<0]#保存原数据的维数

                   A         B         C         D
2001-01-01       NaN -0.518093 -1.913933 -0.311727
2001-01-02       NaN       NaN       NaN -0.753684
2001-01-03       NaN       NaN -0.639484 -0.455028
2001-01-04       NaN -1.513650 -1.440665 -0.208244
2001-01-05       NaN -0.099004       NaN -0.947944
2001-01-06 -0.286218       NaN -0.692970 -0.000308
2001-01-07       NaN -0.060951       NaN -0.749392
2001-01-08       NaN       NaN -0.453764       NaN

In [16]:
df.where(df<0 , -df)#不满足条件的都取相反数
df

                   A         B         C         D
2001-01-01 -1.501492 -0.518093 -1.913933 -0.311727
2001-01-02 -2.276078 -1.028606 -0.912575 -0.753684
2001-01-03 -0.687065 -0.199008 -0.639484 -0.455028
2001-01-04 -2.347048 -1.513650 -1.440665 -0.208244
2001-01-05 -0.996714 -0.099004 -0.154846 -0.947944
2001-01-06 -0.286218 -0.377782 -0.692970 -0.000308
2001-01-07 -1.235501 -0.060951 -2.731867 -0.749392
2001-01-08 -0.626958 -0.669581 -0.453764 -0.892954

In [10]:
s2 = s.copy()
s2

4   -1
3    2
2    3
1    4
0    5
dtype: int64

In [11]:
s2[s2<0] = 0 #可以将不满足的进行强行重置
s2

4    0
3    2
2    3
1    4
0    5
dtype: int64

In [12]:
df2 = df.copy()
df2

                   A         B         C         D
2001-01-01  1.501492 -0.518093 -1.913933 -0.311727
2001-01-02  2.276078  1.028606  0.912575 -0.753684
2001-01-03  0.687065  0.199008 -0.639484 -0.455028
2001-01-04  2.347048 -1.513650 -1.440665 -0.208244
2001-01-05  0.996714 -0.099004  0.154846 -0.947944
2001-01-06 -0.286218  0.377782 -0.692970 -0.000308
2001-01-07  1.235501 -0.060951  2.731867 -0.749392
2001-01-08  0.626958  0.669581 -0.453764  0.892954

In [13]:
df2[df2<0] = 0
df2

                   A         B         C         D
2001-01-01  1.501492  0.000000  0.000000  0.000000
2001-01-02  2.276078  1.028606  0.912575  0.000000
2001-01-03  0.687065  0.199008  0.000000  0.000000
2001-01-04  2.347048  0.000000  0.000000  0.000000
2001-01-05  0.996714  0.000000  0.154846  0.000000
2001-01-06  0.000000  0.377782  0.000000  0.000000
2001-01-07  1.235501  0.000000  2.731867  0.000000
2001-01-08  0.626958  0.669581  0.000000  0.892954

In [18]:
df.where(df<0 , -df) == np.where(df<0 , df , -df)
#可以大致上 认为他们上面两个函数的作用效果是相同的

               A     B     C     D
2001-01-01  True  True  True  True
2001-01-02  True  True  True  True
2001-01-03  True  True  True  True
2001-01-04  True  True  True  True
2001-01-05  True  True  True  True
2001-01-06  True  True  True  True
2001-01-07  True  True  True  True
2001-01-08  True  True  True  True

In [24]:
df2 = df.copy()
df2[df2[1:4]>0] = 3 #重新进行设置值 类似loc功能
df2 #行操作

                   A         B         C         D
2001-01-01 -1.970616  1.776911 -0.753355  0.789666
2001-01-02  3.000000  3.000000  3.000000 -0.880028
2001-01-03 -0.254124  3.000000 -1.504493  3.000000
2001-01-04 -0.141970  3.000000 -0.028522 -0.961068
2001-01-05  0.964364  1.787742 -0.050953 -0.725288
2001-01-06 -0.565382  1.478223 -0.096458  0.666745
2001-01-07  0.315894  0.188798  0.465261 -0.872529
2001-01-08 -0.236235 -0.832285  0.281321  1.246485

In [25]:
df2=df.copy()
df2

                   A         B         C         D
2001-01-01 -1.970616  1.776911 -0.753355  0.789666
2001-01-02  0.879737  0.309945  0.560999 -0.880028
2001-01-03 -0.254124  1.378711 -1.504493  1.932818
2001-01-04 -0.141970  0.606919 -0.028522 -0.961068
2001-01-05  0.964364  1.787742 -0.050953 -0.725288
2001-01-06 -0.565382  1.478223 -0.096458  0.666745
2001-01-07  0.315894  0.188798  0.465261 -0.872529
2001-01-08 -0.236235 -0.832285  0.281321  1.246485

In [27]:
df2.where(df2>0 , df2['A'] , axis='index')
#index 为横方向 将小于等于0的数值设置为与'A'在一行上的值

                   A         B         C         D
2001-01-01 -1.970616  1.776911 -1.970616  0.789666
2001-01-02  0.879737  0.309945  0.560999  0.879737
2001-01-03 -0.254124  1.378711 -0.254124  1.932818
2001-01-04 -0.141970  0.606919 -0.141970 -0.141970
2001-01-05  0.964364  1.787742  0.964364  0.964364
2001-01-06 -0.565382  1.478223 -0.565382  0.666745
2001-01-07  0.315894  0.188798  0.465261  0.315894
2001-01-08 -0.236235 -0.236235  0.281321  1.246485

In [29]:
#上面的写法比下面的运行快 效果一样
df2 = df.copy()
df2.apply(lambda x,y: x.where(x>0 , y) , y=df2['A'])
df2

                   A         B         C         D
2001-01-01 -1.970616  1.776911 -0.753355  0.789666
2001-01-02  0.879737  0.309945  0.560999 -0.880028
2001-01-03 -0.254124  1.378711 -1.504493  1.932818
2001-01-04 -0.141970  0.606919 -0.028522 -0.961068
2001-01-05  0.964364  1.787742 -0.050953 -0.725288
2001-01-06 -0.565382  1.478223 -0.096458  0.666745
2001-01-07  0.315894  0.188798  0.465261 -0.872529
2001-01-08 -0.236235 -0.832285  0.281321  1.246485

In [31]:
#where函数也能接受callable作为条件 一个参数 返回Boolean值
df3 = pd.DataFrame({'A':[1,2,3],
                    'B':[4,5,6],
                    'C':[7,8,9]})
df3

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [32]:
df3.where(lambda x: x>4 , lambda x: x+10)
#将小于等于4的值 设置为在原来的基础上加10

    A   B  C
0  11  14  7
1  12   5  8
2  13   6  9

# mask 函数
### 这个函数和where的作用是相反的
### 与指定的选择式是相反的

In [33]:
s.mask(s>=0) #留下的是相反的

4   -1.0
3    NaN
2    NaN
1    NaN
0    NaN
dtype: float64

In [34]:
df.mask(df>=0)

                   A         B         C         D
2001-01-01 -1.970616       NaN -0.753355       NaN
2001-01-02       NaN       NaN       NaN -0.880028
2001-01-03 -0.254124       NaN -1.504493       NaN
2001-01-04 -0.141970       NaN -0.028522 -0.961068
2001-01-05       NaN       NaN -0.050953 -0.725288
2001-01-06 -0.565382       NaN -0.096458       NaN
2001-01-07       NaN       NaN       NaN -0.872529
2001-01-08 -0.236235 -0.832285       NaN       NaN

# the query method

In [35]:
n=10
df = pd.DataFrame(np.random.randn(n,3),
                  columns = ['a','b','c'])
df

          a         b         c
0 -0.302364  1.038457 -0.116879
1  0.189351 -0.138961  0.500179
2  1.004380 -1.152030 -0.390481
3  0.275649  0.287219 -1.197196
4 -1.665390 -0.782055  0.144955
5 -1.426241  1.157204 -0.441371
6  0.351132 -0.261227 -0.369313
7  0.580350  1.045581  1.678956
8  1.515959  0.705996 -0.773450
9  1.181749  0.018012 -1.048236

In [36]:
#原始python书写方法
df[(df.a<df.b) & (df.b<df.c)]
#逻辑在列与列之间
#筛选结果是一些行

         a         b         c
4 -1.66539 -0.782055  0.144955
7  0.58035  1.045581  1.678956

In [37]:
#使用query方法 类似mysql API的查询函数
df.query('(a<b) & (b<c)')

         a         b         c
4 -1.66539 -0.782055  0.144955
7  0.58035  1.045581  1.678956

In [38]:
df = pd.DataFrame(np.random.randint(n/2 , size=(n,2)),
                  columns=['b','c'])
df

   b  c
0  3  1
1  4  4
2  3  0
3  3  1
4  2  0
5  3  2
6  2  0
7  4  1
8  2  1
9  0  4

In [44]:
df.index.name = 'a'

In [45]:
df

   b  c
a
0  3  1
1  4  4
2  3  0
3  3  1
4  2  0
5  3  2
6  2  0
7  4  1
8  2  1
9  0  4

In [48]:
df.index #index的名字（name）是'a'

RangeIndex(start=0, stop=10, step=1, name='a')

In [49]:
df.columns

Index(['b', 'c'], dtype='object')

In [50]:
df.query('a<b and b<c')
#df.query('(a<b) & (b<c)')
#上面两种写法是一样的

Empty DataFrame
Columns: [b, c]
Index: []

In [51]:
#如果不想给index起名字也可以 直接使用‘index’作为index的名字
df.query('index<b<c')

Empty DataFrame
Columns: [b, c]
Index: []

In [53]:
#如果index的名字和columns的名字冲突了 那么columns优先
df = pd.DataFrame({'a':np.random.randint(5 , size = 5)})
df.index.name = 'a'
df #构造了一个index name and column name一样的dataframe

   a
a
0  0
1  0
2  0
3  4
4  1

In [54]:
df.query('a>2') #这里的a是column

   a
a
3  4

In [56]:
df.query('index>2') #这里'index'指的是index name 即index中大于2的

   a
a
3  4
4  1

In [58]:
df = pd.DataFrame({'index':[1,2,3,4,5]})
df.index.name = 'index'
df

       index
index
0          1
1          2
2          3
3          4
4          5

In [62]:
df.query('index>=3') #这个index是column 应该尽可能不重名使用名字

       index
index
2          3
3          4
4          5

# multiindex query() syntax

In [63]:
n=10
colors = np.random.choice(['red' , 'green'] , size = n)
foods = np.random.choice(['eggs' , 'ham'] , size = n)
colors

array(['red', 'green', 'red', 'green', 'red', 'green', 'green', 'green',
       'red', 'green'],
      dtype='<U5')

In [64]:
foods

array(['ham', 'ham', 'eggs', 'eggs', 'ham', 'ham', 'eggs', 'ham', 'eggs',
       'ham'],
      dtype='<U4')

In [65]:
index = pd.MultiIndex.from_arrays([colors , foods] , names=['color','food'])
df = pd.DataFrame(np.random.randn(n , 2) , index=index)
df

                   0         1
color food
red   ham  -1.550345  0.517564
green ham  -0.251312 -1.369798
red   eggs  0.330576 -0.603758
green eggs  0.598762  0.745389
red   ham  -1.151272 -0.702885
green ham   0.566536  0.465715
      eggs  0.389484 -0.847849
      ham  -0.927087  1.016240
red   eggs  0.670107 -1.044880
green ham   1.305938  0.356496

In [68]:
df.query('color == "red"')

                   0         1
color food
red   ham  -1.550345  0.517564
      eggs  0.330576 -0.603758
      ham  -1.151272 -0.702885
      eggs  0.670107 -1.044880

In [70]:
#重新设置index  不给index名字 设为None
df.index.names = [None , None]
df

                   0         1
red   ham  -1.550345  0.517564
green ham  -0.251312 -1.369798
red   eggs  0.330576 -0.603758
green eggs  0.598762  0.745389
red   ham  -1.151272 -0.702885
green ham   0.566536  0.465715
      eggs  0.389484 -0.847849
      ham  -0.927087  1.016240
red   eggs  0.670107 -1.044880
green ham   1.305938  0.356496

In [71]:
df.query('ilevel_0 == "red"')
#ilevel_0是一种套俗
#index level 0
#0th level of the index

                 0         1
red ham  -1.550345  0.517564
    eggs  0.330576 -0.603758
    ham  -1.151272 -0.702885
    eggs  0.670107 -1.044880

# query() use cases

In [72]:
df = pd.DataFrame(np.random.rand(n , 3) , columns=['a','b','c'])
df

          a         b         c
0  0.739817  0.660674  0.275018
1  0.385372  0.947630  0.462189
2  0.980244  0.543300  0.533966
3  0.500646  0.655313  0.701312
4  0.764842  0.354192  0.220589
5  0.748817  0.903637  0.348376
6  0.759240  0.228678  0.344111
7  0.794132  0.302772  0.078232
8  0.076840  0.834279  0.751507
9  0.113229  0.030144  0.473856

In [73]:
df2 = pd.DataFrame(np.random.rand(n+2 , 3) , columns=df.columns)
df2

           a         b         c
0   0.052925  0.191208  0.513330
1   0.080277  0.138874  0.159969
2   0.584851  0.619350  0.704025
3   0.560104  0.185788  0.168379
4   0.014312  0.095363  0.104196
5   0.355832  0.106276  0.949681
6   0.362100  0.613793  0.973245
7   0.336121  0.538459  0.649935
8   0.068743  0.233128  0.692553
9   0.119836  0.930644  0.235515
10  0.661509  0.050853  0.331783
11  0.083088  0.999300  0.656706

In [74]:
expr = '0.0 <= a <= c <= 0.5'
map(lambda frame: frame.query(expr) , [df , df2])

# query() python versus syntax comparison

In [76]:
df = pd.DataFrame(np.random.randint(n , size=(n,3)),
                  columns = ['a','b','c'])
df

   a  b  c
0  9  1  0
1  6  5  8
2  6  1  8
3  8  0  2
4  5  0  1
5  9  1  9
6  0  6  9
7  5  8  7
8  9  4  2
9  5  6  2

In [77]:
df.query('(a<b) & (b<c)')
#df.query('a<b and b<c") #和上面的作用是一样的
#df.query('a<b & b<c')
#df.query('a<b<c) #作用是一样的

   a  b  c
6  0  6  9

In [78]:
df[(df.a < df.b) & (df.b<df.c)]

   a  b  c
6  0  6  9

   a  b  c
6  0  6  9

# the in and not in operators

In [80]:
#这里 存在一个函数叫 isin
df = pd.DataFrame({'a':list('aabbccddeeff'),
                   'b':list('aaaabbbbcccc'),
                   'c':np.random.randint(5 , size = 12),
                   'd':np.random.randint(9 , size= 12)})
df

    a  b  c  d
0   a  a  2  3
1   a  a  2  1
2   b  a  0  6
3   b  a  3  7
4   c  b  1  6
5   c  b  3  7
6   d  b  1  3
7   d  b  3  4
8   e  c  0  1
9   e  c  1  4
10  f  c  4  2
11  f  c  3  3

In [82]:
df.query('a in b')
#column a中有 a b c d e f
#column b中有 a b c

   a  b  c  d
0  a  a  2  3
1  a  a  2  1
2  b  a  0  6
3  b  a  3  7
4  c  b  1  6
5  c  b  3  7

In [83]:
df.query('c in d')

    a  b  c  d
0   a  a  2  3
1   a  a  2  1
3   b  a  3  7
4   c  b  1  6
5   c  b  3  7
6   d  b  1  3
7   d  b  3  4
9   e  c  1  4
10  f  c  4  2
11  f  c  3  3

In [84]:
df[df.a.isin(df.b)] #与上面的写法是一样的

   a  b  c  d
0  a  a  2  3
1  a  a  2  1
2  b  a  0  6
3  b  a  3  7
4  c  b  1  6
5  c  b  3  7

In [86]:
df.query('a not in b')
#b中没有d e f

    a  b  c  d
6   d  b  1  3
7   d  b  3  4
8   e  c  0  1
9   e  c  1  4
10  f  c  4  2
11  f  c  3  3

In [87]:
df[~df.a.isin(df.b)] #与上面的作用是一样的

    a  b  c  d
6   d  b  1  3
7   d  b  3  4
8   e  c  0  1
9   e  c  1  4
10  f  c  4  2
11  f  c  3  3

In [88]:
#可以在query中 把最前面的那些逻辑式和这里的in not in结合起来
df.query('a in b and c < d')

   a  b  c  d
0  a  a  2  3
2  b  a  0  6
3  b  a  3  7
4  c  b  1  6
5  c  b  3  7

In [89]:
df[df.b.isin(df.a) & (df.c < df.d)]

   a  b  c  d
0  a  a  2  3
2  b  a  0  6
3  b  a  3  7
4  c  b  1  6
5  c  b  3  7
6  d  b  1  3
7  d  b  3  4
8  e  c  0  1
9  e  c  1  4

In [91]:
#df.query('a in b+c+d')
#typeerror

# special use of the == operator with list objects

In [95]:
df.query('b == ["a","b"]')

   a  b  c  d
0  a  a  2  3
1  a  a  2  1
2  b  a  0  6
3  b  a  3  7
4  c  b  1  6
5  c  b  3  7
6  d  b  1  3
7  d  b  3  4

In [96]:
df[df.b.isin(["a","b"])] #和上面的写法作用是一样的

   a  b  c  d
0  a  a  2  3
1  a  a  2  1
2  b  a  0  6
3  b  a  3  7
4  c  b  1  6
5  c  b  3  7
6  d  b  1  3
7  d  b  3  4

In [94]:
df.query('c == [1,2]')

   a  b  c  d
0  a  a  2  3
1  a  a  2  1
4  c  b  1  6
6  d  b  1  3
9  e  c  1  4

In [97]:
df.query('c != [1,2]')

    a  b  c  d
2   b  a  0  6
3   b  a  3  7
5   c  b  3  7
7   d  b  3  4
8   e  c  0  1
10  f  c  4  2
11  f  c  3  3

In [98]:
df.query('[1,2] in c')

   a  b  c  d
0  a  a  2  3
1  a  a  2  1
4  c  b  1  6
6  d  b  1  3
9  e  c  1  4

In [99]:
df.query('[1,2]not in c')

    a  b  c  d
2   b  a  0  6
3   b  a  3  7
5   c  b  3  7
7   d  b  3  4
8   e  c  0  1
10  f  c  4  2
11  f  c  3  3

In [100]:
df[df.c.isin([1,2])] #与上面写法的作用是一样的

   a  b  c  d
0  a  a  2  3
1  a  a  2  1
4  c  b  1  6
6  d  b  1  3
9  e  c  1  4

# boolean operators

In [101]:
#可以使用取反运算符 ~  来否定一个逻辑表达式（布尔表达式）
df = pd.DataFrame(np.random.rand(n , 3) , columns=['a','b','c'])
df

          a         b         c
0  0.468114  0.702322  0.922366
1  0.107968  0.700700  0.123626
2  0.562551  0.398932  0.386669
3  0.245454  0.053530  0.846020
4  0.605599  0.002231  0.232493
5  0.147275  0.155359  0.437622
6  0.041608  0.262197  0.216357
7  0.262854  0.440453  0.327286
8  0.049680  0.264782  0.515821
9  0.095952  0.031299  0.403244

In [106]:
len(df)

10

In [107]:
df['bools'] = np.random.rand(len(df))>0.5

In [108]:
df

          a         b         c  bools
0  0.468114  0.702322  0.922366  False
1  0.107968  0.700700  0.123626   True
2  0.562551  0.398932  0.386669   True
3  0.245454  0.053530  0.846020  False
4  0.605599  0.002231  0.232493  False
5  0.147275  0.155359  0.437622  False
6  0.041608  0.262197  0.216357  False
7  0.262854  0.440453  0.327286  False
8  0.049680  0.264782  0.515821   True
9  0.095952  0.031299  0.403244  False

In [109]:
df.query('~bools')

          a         b         c  bools
0  0.468114  0.702322  0.922366  False
3  0.245454  0.053530  0.846020  False
4  0.605599  0.002231  0.232493  False
5  0.147275  0.155359  0.437622  False
6  0.041608  0.262197  0.216357  False
7  0.262854  0.440453  0.327286  False
9  0.095952  0.031299  0.403244  False

In [110]:
df.query('not bools')

          a         b         c  bools
0  0.468114  0.702322  0.922366  False
3  0.245454  0.053530  0.846020  False
4  0.605599  0.002231  0.232493  False
5  0.147275  0.155359  0.437622  False
6  0.041608  0.262197  0.216357  False
7  0.262854  0.440453  0.327286  False
9  0.095952  0.031299  0.403244  False

In [112]:
df[~df.bools]

          a         b         c  bools
0  0.468114  0.702322  0.922366  False
3  0.245454  0.053530  0.846020  False
4  0.605599  0.002231  0.232493  False
5  0.147275  0.155359  0.437622  False
6  0.041608  0.262197  0.216357  False
7  0.262854  0.440453  0.327286  False
9  0.095952  0.031299  0.403244  False

In [111]:
df.query('not bools') == df[~df.bools]

      a     b     c  bools
0  True  True  True   True
3  True  True  True   True
4  True  True  True   True
5  True  True  True   True
6  True  True  True   True
7  True  True  True   True
9  True  True  True   True

In [113]:
#布尔表达式可以超级无敌地进行复杂 功能更强 效率更低
shorter = df.query('a<b<c and (not bools) or bools>2')
shorter

          a         b         c  bools
0  0.468114  0.702322  0.922366  False
5  0.147275  0.155359  0.437622  False

In [115]:
longer = df[(df.a < df.b) &(df.b<df.c) & (~df.bools) | (df.bools>2)]
longer

          a         b         c  bools
0  0.468114  0.702322  0.922366  False
5  0.147275  0.155359  0.437622  False

In [116]:
shorter == longer

      a     b     c  bools
0  True  True  True   True
5  True  True  True   True

In [117]:
#200000行的frame时 numexpr效率比query高

# duplicate data

In [119]:
#如果有重复的行 进行处理
#可以有两个函数使用
#duplicated drop_duplicates
df2 = pd.DataFrame({'a':['one','one','two','two','two','three','four'],
                    'b':['x','y','x','y','x','x','x'],
                    'c':np.random.randn(7)})
df2

       a  b         c
0    one  x  0.738759
1    one  y  0.263019
2    two  x -0.639544
3    two  y -1.297785
4    two  x -0.124591
5  three  x  1.954035
6   four  x  0.022658

In [120]:
df2.duplicated('a') #column 'a' 是否有重复的值
#为True的地方就是重复的
#默认保留第一个为不重复的

0    False
1     True
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [121]:
df2.duplicated('a' , keep='last') #只保留最后一个为不重复的

0     True
1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

In [122]:
df2.duplicated('a' , keep=False)
#将有重复的值 就是重复值
#重复值显示True

0     True
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [123]:
df2.drop_duplicates('a') #将重复值删除的只留下第一个

       a  b         c
0    one  x  0.738759
2    two  x -0.639544
5  three  x  1.954035
6   four  x  0.022658

In [124]:
df2.drop_duplicates('a' , keep='last')
##将重复值删除的只留下最后一个

       a  b         c
1    one  y  0.263019
4    two  x -0.124591
5  three  x  1.954035
6   four  x  0.022658

In [125]:
df2.drop_duplicates('a' , keep=False)
#重复值全部删除了  只要出现重复的就删除

       a  b         c
5  three  x  1.954035
6   four  x  0.022658

In [126]:
df2

       a  b         c
0    one  x  0.738759
1    one  y  0.263019
2    two  x -0.639544
3    two  y -1.297785
4    two  x -0.124591
5  three  x  1.954035
6   four  x  0.022658

In [127]:
df2.duplicated(['a','b']) #两个捆绑起来看是否有重复的

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [128]:
df2.drop_duplicates(['a','b'])
#删除重复值 只保留第一个 keep=first 默认是first

       a  b         c
0    one  x  0.738759
1    one  y  0.263019
2    two  x -0.639544
3    two  y -1.297785
5  three  x  1.954035
6   four  x  0.022658

In [129]:
df3 = pd.DataFrame({'a':np.arange(6),
                    'b':np.random.randn(6)},
                 index = ['a','a','b','c','b','a'])
df3

   a         b
a  0 -1.271631
a  1  0.437105
b  2  0.651441
c  3  1.542967
b  4 -0.649981
a  5  1.288982

In [130]:
#上面构造的df3的index 出现了重复的value  也可以进行处理
df3.index.duplicated()
#False的为保留的重复值中的一个
#True为重复的

array([False,  True, False, False,  True,  True], dtype=bool)

In [132]:
df3[~df3.index.duplicated()]

   a         b
a  0 -1.271631
b  2  0.651441
c  3  1.542967

In [133]:
df3[~df3.index.duplicated(keep='last')]

   a         b
c  3  1.542967
b  4 -0.649981
a  5  1.288982

In [134]:
df3[~df3.index.duplicated(keep = False)] #所有的重复的都标记为True
#一个也不保留

   a         b
c  3  1.542967

# dictionary-like get method

In [135]:
s = pd.Series([1,2,3] , index=['a','b','c'])
s

a    1
b    2
c    3
dtype: int64

In [139]:
s.get('s' , default='no')

'no'

# the lookup method

In [140]:
dflookup = pd.DataFrame(np.random.rand(20,4) , columns=['A','B','C','D'])
dflookup

           A         B         C         D
0   0.344937  0.034124  0.479084  0.652445
1   0.711335  0.415812  0.672247  0.041037
2   0.668554  0.619254  0.443885  0.555984
3   0.236393  0.865670  0.040685  0.797327
4   0.350206  0.402893  0.791631  0.768317
5   0.341563  0.839066  0.478100  0.789448
6   0.187346  0.675692  0.077957  0.852031
7   0.988831  0.050489  0.569772  0.283375
8   0.782258  0.308375  0.676165  0.719432
9   0.557079  0.400626  0.638442  0.405260
10  0.084263  0.893438  0.966179  0.524527
11  0.943841  0.479503  0.150777  0.305600
12  0.884200  0.681178  0.415895  0.575560
13  0.683928  0.963824  0.909256  0.612629
14  0.863955  0.283101  0.150441  0.828050
15  0.538256  0.925443  0.916892  0.418661
16  0.474041  0.325708  0.224072  0.002824
17  0.441800  0.616938  0.109538  0.849836
18  0.800074  0.107311  0.828886  0.716970
19  0.043946  0.914002  0.661604  0.426123

In [141]:
dflookup.lookup(list(range(0,10,2)) , ['B','C','A','B','D'])
#row 0 column B
#row 2 column C
#etc

array([ 0.03412422,  0.44388544,  0.35020586,  0.67569165,  0.71943159])

# index object

In [142]:
index = pd.Index(['e','d','a','b'])
index

Index(['e', 'd', 'a', 'b'], dtype='object')

In [143]:
'd' in index

True

In [144]:
index = pd.Index(['e','d','a','b'] , name = 'something')
index.name

'something'

In [145]:
index = pd.Index(list(range(5)) , name = 'rows')
columns = pd.Index(['A','B','C'] , name = 'cols')
df = pd.DataFrame(np.random.randn(5,3) , index=index , columns=columns)
df

cols         A         B         C
rows
0     1.345518 -1.408296 -1.296659
1    -0.188877  0.059241 -1.256354
2     0.660596 -0.872690  0.380173
3     0.753097 -0.128428  1.304378
4     0.022082  1.167163  0.755864

# setting metadate

In [146]:
'''Indexes are “mostly immutable”, but it is possible to set and change their metadata, like the index name (or, for MultiIndex, levels and labels).

You can use the rename, set_names, set_levels, and set_labels to set these attributes directly. They default to returning a copy; however, you can specify inplace=True to have the data change in place.'''

'Indexes are “mostly immutable”, but it is possible to set and change their metadata, like the index name (or, for MultiIndex, levels and labels).\n\nYou can use the rename, set_names, set_levels, and set_labels to set these attributes directly. They default to returning a copy; however, you can specify inplace=True to have the data change in place.'

In [147]:
ind = pd.Index([1,2,3])
ind

Int64Index([1, 2, 3], dtype='int64')

In [148]:
ind.rename('apple')

Int64Index([1, 2, 3], dtype='int64', name='apple')

In [149]:
ind #因为inplace是false 所以调用这没有变

Int64Index([1, 2, 3], dtype='int64')

In [150]:
ind.rename('apple' , inplace=True)

In [151]:
ind

Int64Index([1, 2, 3], dtype='int64', name='apple')

In [152]:
#set_names 也可以有同样的效果

In [153]:
index = pd.MultiIndex.from_product([range(3) , ['one','two']] ,
                                  names = ['first','second'])
index

MultiIndex(levels=[[0, 1, 2], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [154]:
index.levels

FrozenList([[0, 1, 2], ['one', 'two']])

In [ ]:
index.set_levels(['a','b'],level=1)

# set operations on index object

In [158]:
#index对象 可以参与运算
a = pd.Index(['c','b','a'])
b = pd.Index(['c','e','d','a'])

a|b

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [160]:
a&b

Index(['c', 'a'], dtype='object')

In [159]:
a.difference(b)

Index(['b'], dtype='object')

In [161]:
'''Also available is the symmetric_difference (^) operation, which returns elements that appear in either idx1 or idx2 but not both. This is equivalent to the Index created by idx1.difference(idx2).union(idx2.difference(idx1)), with duplicates dropped.'''

'Also available is the symmetric_difference (^) operation, which returns elements that appear in either idx1 or idx2 but not both. This is equivalent to the Index created by idx1.difference(idx2).union(idx2.difference(idx1)), with duplicates dropped.'

In [163]:
idx1 = pd.Index([1,2,3,4])
idx2 = pd.Index([2,3,4,5])

idx1.symmetric_difference(idx2)

Int64Index([1, 5], dtype='int64')

In [165]:
idx2.symmetric_difference(idx1)

Int64Index([1, 5], dtype='int64')

In [166]:
idx1 ^ idx2

Int64Index([1, 5], dtype='int64')

# missing values

In [167]:
#index能够处理缺失值 但是不建议使用  这样可能会出现意想不到的结果
idx1 = pd.Index([1 , np.nan , 3 , 4])
idx1

Float64Index([1.0, nan, 3.0, 4.0], dtype='float64')

In [168]:
idx1.fillna(2) #用2填充所有的缺失值

Float64Index([1.0, 2.0, 3.0, 4.0], dtype='float64')

In [170]:
idx2 = pd.DatetimeIndex([pd.Timestamp('2011-01-01'),
                        pd.NaT , pd.Timestamp('2001-01-03')])
idx2

DatetimeIndex(['2011-01-01', 'NaT', '2001-01-03'], dtype='datetime64[ns]', freq=None)

In [171]:
idx2.fillna(pd.Timestamp('2011-01-02'))

DatetimeIndex(['2011-01-01', '2011-01-02', '2001-01-03'], dtype='datetime64[ns]', freq=None)

# set reset index

In [173]:
#dataframe在最后添加一个index
#dataframe 有方法 set_index可以设置
#set_index的参数是在dataframe中存在的column 用来做index
data = pd.DataFrame({'a':['bar','bar','foo','foo'],
                    'b':['one','two','one','two'],
                    'c':['z','y','x','w'],
                    'd':[1.0,2.0,3.0,4.0]})
data

     a    b  c    d
0  bar  one  z  1.0
1  bar  two  y  2.0
2  foo  one  x  3.0
3  foo  two  w  4.0

In [174]:
indexed1 = data.set_index('c')
indexed1

     a    b    d
c
z  bar  one  1.0
y  bar  two  2.0
x  foo  one  3.0
w  foo  two  4.0

In [175]:
indexed1.index

Index(['z', 'y', 'x', 'w'], dtype='object', name='c')

In [176]:
indexed2 = data.set_index(['a','b'])
indexed2

         c    d
a   b
bar one  z  1.0
    two  y  2.0
foo one  x  3.0
    two  w  4.0

In [177]:
frame = data.set_index('c' , drop = False) #用column c来做index 而且不删除原有的column c
#上面的函数 set_index 会删除column c的
frame

     a    b  c    d
c
z  bar  one  z  1.0
y  bar  two  y  2.0
x  foo  one  x  3.0
w  foo  two  w  4.0

In [178]:
frame = frame.set_index(['a','b'] , append=True)
#append 为 True 不会将原来的index c 删除掉
frame

           c    d
c a   b
z bar one  z  1.0
y bar two  y  2.0
x foo one  x  3.0
w foo two  w  4.0

In [179]:
data.set_index('c' , drop=False)
#用column c做index  并且不删除column c

     a    b  c    d
c
z  bar  one  z  1.0
y  bar  two  y  2.0
x  foo  one  x  3.0
w  foo  two  w  4.0

In [180]:
data.set_index(['a','b'] , inplace = True) #默认 drop=True

In [181]:
data

         c    d
a   b
bar one  z  1.0
    two  y  2.0
foo one  x  3.0
    two  w  4.0

# reset the index
http://pandas.pydata.org/pandas-docs/stable/indexing.html#the-where-method-and-masking